---
type: StructuralMaterialTypeFilter
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralMaterialTypeFilter

`Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralMaterialTypeFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | StructuralMaterialType | 2011 | `public StructuralMaterialType StructuralMaterialType { get ; }` |